ocram72nl/ESP32-HUB75-MatrixPanel-DMA-FM6363/src/ESP32-HUB75-MatrixPanel-DMA-fm6363c.cpp
#include <Arduino.h>
#include "ESP32-HUB75-MatrixPanel-DMA-fm6363c.h"
#include "ESP32-HUB75-MatrixPanel-DMA-leddrivers.h"

#ifndef DISABLE_SERIAL_DEBUG
  #define SERIAL_DEBUG
#endif

#define offset_prefix  dma_buff.all_row_data_cnt
#define offset_suffix  (dma_buff.all_row_data_cnt + dma_buff.frame_prefix_cnt)
/***************************************************************************************/

#ifndef NO_CIE1931
#endif

typedef struct {
  int16_t x;
  int16_t y;
}coords_t;

// Max clock cycles to blank OE before/after LAT signal change
//enum{CLKS_DURING_LATCH = 0};

//for callback handler
MatrixPanel_DMA* MatrixPanel = NULL;


//clearing buffers if initialization fails
void MatrixPanel_DMA::buffersFree()
{
  int i;
  if (dma_buff.rowBits != NULL)
  {
    i = dma_buff.all_row_data_cnt + dma_buff.frame_prefix_cnt + dma_buff.frame_suffix_cnt;
    while (i > 0)
    {
      i--;
      if (dma_buff.rowBits[i] != NULL)
      {
        heap_caps_free(dma_buff.rowBits[i]);
      }
    }
    heap_caps_free(dma_buff.rowBits);
  }
  for(i = m_cfg.double_buff-1; i >= 0; i--)
  {
    if(frame_buffer.frameBits[i] != NULL)
    {
      heap_caps_free(frame_buffer.frameBits[i]);
    }
  }
  if (dmadesc_data[0] != NULL)
  {
    heap_caps_free(dmadesc_data[0]);
  }
  if (brightness_table != NULL)
  {
    heap_caps_free(brightness_table);
  }

}

//----------------------------------//
//  Output functions for the panel  //
//----------------------------------//

// Get the color of a pixel in the frame buffer
#ifdef USE_COLORx16
inline void MatrixPanel_DMA::getRGBColor16(int offset_y, int offset_x, rgb888_t& rgb888)
{
  uint16_t* addr = (uint16_t*)&frame_buffer.frameBits[back_buffer_id^m_cfg.double_buff][offset_y];
  color565to888(addr[offset_x], rgb888.r,rgb888.g, rgb888.b);
}
#endif


// Preparing the DMA buffer
// Check what this function does. Is it preparing multiple rows, or a single row?
IRAM_ATTR void MatrixPanel_DMA::prepareDmaRows(uint8_t row_offset, uint8_t dma_buff_id)
{
  rgb888_t pixel888_1;
  rgb888_t pixel888_2;
  driver_rgb_t pixel1;
  driver_rgb_t pixel2;

  if (FM6363_clear) return;

  // Update row_offset
  row_offset = (rows_per_frame - row_offset) + scroll_y;    // - dma_buff.row_data_cnt;// + scroll_y;
  //row_offset
  for(int row_buf_id = 0; row_buf_id < dma_buff.row_data_cnt; row_buf_id++)
  {
    //roll shift along y
    if (row_offset >= rows_per_frame) row_offset -= rows_per_frame;
    //offset to video buffer line
    int offset_y = row_offset*frame_buffer.row_len;

    //offsets for the output buffer
    int dma_buff_offset = 0;        //DRIVER_BITS;
    int  dma_buff_offset_next = 0;  //DRIVER_BITS;
    int driver_idx = DRIVER_BITS;
    int offset_x;
    if (hw_mirror_x)
    {
      //roll shift in x
      offset_x = pixels_per_row + scroll_x - 1;
      if (offset_x >= pixels_per_row) offset_x -= pixels_per_row;
    }else
    {
      //roll shift in x
      offset_x = 0 - scroll_x;
      if (offset_x < 0 ) offset_x += pixels_per_row;
    }
    //index of the line in the DMA buffer
    //for a single buffer dma_buff_id = 0
    int row_dma_offset = (dma_buff_id)?(row_buf_id + dma_buff.row_data_cnt):row_buf_id;

    int8_t color_bits = dma_buff.color_bits;
    for (int i = pixels_per_row; i > 0; i--)
    {
      switch (color_bits)
      {
        #ifdef USE_COLORx16
        // Why is this -16? color_bits = 16, so not negative?!?
        case -16:
          getRGBColor16(offset_y, offset_x, pixel888_1);
          getRGBColor16(offset_y + (frame_buffer.subframe_len >> 1), offset_x, pixel888_2);
        break;
        #endif
        default:
          if (getUserRGB != NULL) getUserRGB(row_offset, offset_x, pixel888_1, pixel888_2);
        break;
      }

      if (negative_panel)
      {
        pixel888_1.r = ~pixel888_1.r;
        pixel888_1.g = ~pixel888_1.g;
        pixel888_1.b = ~pixel888_1.b;
        pixel888_2.r = ~pixel888_2.r;
        pixel888_2.g = ~pixel888_2.g;
        pixel888_2.b = ~pixel888_2.b;
      }
      // THe brightness table contains uin16_t values
      pixel1.r = brightness_table[pixel888_1.r];
      pixel1.g = brightness_table[pixel888_1.g];
      pixel1.b = brightness_table[pixel888_1.b];
      pixel2.r = brightness_table[pixel888_2.r];
      pixel2.g = brightness_table[pixel888_2.g];
      pixel2.b = brightness_table[pixel888_2.b];


      //output pixel to video buffer
      ESP32_I2S_DMA_STORAGE_TYPE mask_rgb12;
      for (int j = DRIVER_BITS-1; j >= 0; j--)
      {
        mask_rgb12 = 0;
        if (pixel1.r & 0x8000) mask_rgb12 |= BIT_R1; pixel1.r <<= 1;
        if (pixel1.g & 0x8000) mask_rgb12 |= BIT_G1; pixel1.g <<= 1;
        if (pixel1.b & 0x8000) mask_rgb12 |= BIT_B1; pixel1.b <<= 1;
        if (pixel2.r & 0x8000) mask_rgb12 |= BIT_R2; pixel2.r <<= 1;
        if (pixel2.g & 0x8000) mask_rgb12 |= BIT_G2; pixel2.g <<= 1;
        if (pixel2.b & 0x8000) mask_rgb12 |= BIT_B2; pixel2.b <<= 1;

        int offset_dma = dma_buff_offset ^ 1;
        dma_buff.rowBits[row_dma_offset][offset_dma] = (dma_buff.rowBits[row_dma_offset][offset_dma] & (~BITMASK_RGB12))|mask_rgb12;
        dma_buff_offset++;
      }
      driver_idx--;
      if (driver_idx == 0)
      {
        driver_idx = DRIVER_BITS;
        dma_buff_offset_next += DRIVER_BITS;
        dma_buff_offset = dma_buff_offset_next;
      }else
      {
        dma_buff_offset += pixels_per_row + SUBROW_ADD_LEN - DRIVER_BITS;
      }
      if (hw_mirror_x)
      {
        if (offset_x == 0) offset_x = pixels_per_row - 1;
        else offset_x--;
      }else
      {
        offset_x++;
        if (pixels_per_row == 0) offset_x = 0;
      }
    }
    row_offset++;
  }
}


//turn off panel driver output
void MatrixPanel_DMA::panelShowOff()
{
  if (m_cfg.driver == FM6363)
  {
    //it can be simpler, but then you need to fence another DMA buffer and switch to it only for one command
    waitDmaReady();
    FM6363setVSync(false, false);
    sendVsync();
    waitDmaReady();
    FM6363setVSync(false, true);
  }else
  {
    //shift
  }
}

//enable output of panel drivers
void MatrixPanel_DMA::panelShowOn()
{
  if (m_cfg.driver == FM6363)
  {
    //it can be simpler, but then you need to fence another DMA buffer and switch to it only for one command
    waitDmaReady();
    FM6363setVSync(true, false);
    sendVsync();
    waitDmaReady();
    FM6363setVSync(true, true);
  }else
  {
    //shift
  }
}

//preparing the prefix and switching DMA output
// This function seems to always set a register based on driver_cur_reg variable
IRAM_ATTR void MatrixPanel_DMA::sendCBVsync()
{
  FM6363setReg(driver_cur_reg, (&driver_reg[driver_cur_reg]));      // We do not need to set the registers every time we want to send Vsync ?!?
  driver_cur_reg++;
  if (driver_cur_reg >= FM6363_REG_CNT) driver_cur_reg = 0;

  //prefix to tank-suffix
  dmadesc_ext[FM6363_EXT_PREFIX].qe.stqe_next = &dmadesc_suffix[cur_suffix_id][prefix_to_suffix];
  //loop the tank-suffix
  dmadesc_suffix[cur_suffix_id][desc_suffix_cnt-1].qe.stqe_next = dmadesc_suffix[cur_suffix_id];
  dmadesc_suffix[cur_suffix_id][desc_suffix_cnt-1].eof = true;
  //change cur_suffix_id
  cur_suffix_id ^= 1;
  //front suffix to prefix
  dmadesc_suffix[cur_suffix_id][desc_suffix_cnt-1].qe.stqe_next = dmadesc_prefix;
  //wait for interruption of the end of transmission of the front suffix and prefix
  dma_int_cnt = -1;
  //dmadesc_suffix[cur_suffix_id][desc_suffix_cnt-1].eof = true;
}

//switch DMA output to line
IRAM_ATTR void MatrixPanel_DMA::sendCBRow(uint8_t buff_id)
{

  //line data for tank-suffix
  dmadesc_ext[FM6363_EXT_DATA].qe.stqe_next = &dmadesc_suffix[cur_suffix_id][data_to_suffix];
  //loop the tank-suffix
  dmadesc_suffix[cur_suffix_id][desc_suffix_cnt-1].qe.stqe_next = dmadesc_suffix[cur_suffix_id];
  dmadesc_suffix[cur_suffix_id][desc_suffix_cnt-1].eof = true;
  //change cur_suffix_id
  cur_suffix_id ^= 1;
  //front suffix on the line data;
  dmadesc_suffix[cur_suffix_id][desc_suffix_cnt-1].qe.stqe_next = dmadesc_data[buff_id];
  //wait for interruption of the end of transmission of the front suffix and line data
  dma_int_cnt = -1;
  //dmadesc_suffix[cur_suffix_id][desc_suffix_cnt-1].eof = true;    // MWA: Why is this commented out?
}

//string output handler
IRAM_ATTR void MatrixPanel_DMA::sendCallback()
{
  static uint8_t dma_buffer_id = 0;
  if (bufferBusy || bufferReady || dma_int_cnt > 0) return;
  bufferBusy = true;
  dma_int_cnt++;

  if (dma_int_cnt > 0)
  {
    dmadesc_suffix[cur_suffix_id^1][desc_suffix_cnt-1].eof = false;

