ocram72nl/ESP32-HUB75-MatrixPanel-DMA-FM6363/src/ESP32-HUB75-MatrixPanel-DMA-fm6363c.cpp
    if (rows_send_cnt > 0)
    {
      //int row_send_idx = rows_send_cnt-1;
      //sending DMA buffer lines
      if (m_cfg.double_dma_buff)
      {
        //double line buffer
        if (rows_send_cnt == rows_per_frame)
        {
          //prepare the first DMA buffer
          prepareDmaRows(rows_send_cnt, dma_buffer_id);
          //output the first DMA buffer
          sendCBRow(dma_buffer_id);
          dma_buffer_id ^= 1;           // Toggles dma_buffer_id from 0 to 1
        }else
        {
          //output another DMA buffer
          sendCBRow(dma_buffer_id^1);
        }
        if (rows_send_cnt > dma_buff.row_data_cnt)
        {
          //prepare another DMA buffer
          prepareDmaRows(rows_send_cnt - dma_buff.row_data_cnt, dma_buffer_id);
          dma_buffer_id ^= 1;
        }
      }else
      {
        //single line buffer
        //prepare the string
        prepareDmaRows(rows_send_cnt, 0);
        //выводим строку
        sendCBRow(0);
      }

      rows_send_cnt -= dma_buff.row_data_cnt;
      if (rows_send_cnt <= 0)
      {
        FM6363_clear = false;
        //automatic image output with FM6363_auto_vsync = 1
        if (FM6363_auto_vsync) rows_send_cnt = 0;
        else rows_send_cnt = -1;
        dma_int_cnt = -4; //crutch for DMA_CLOCK > 5Mhz - need to figure it out
      }
    }else if (rows_send_cnt == 0)
    {
      //send sync after sending DMA buffer lines
      sendCBVsync();
      //Serial.print("*");
      rows_send_cnt = -1;
    }else
    {
      //DMA transfer done, DMA free for next transfer
      bufferReady = true;
    }
  }
  bufferBusy= false;
}

//DMA interrupt handler
//allowed at the beginning of the DMA send (EOF)
//triggered at the end of the message
IRAM_ATTR void FM6363i2sCallback()
{
  MatrixPanel->sendCallback();
}


//waiting for DMA to be ready
void MatrixPanel_DMA::waitDmaReady()
{
  if (frame_buffer.len == 0) return;
  while(!bufferReady)
  {
    delay(1);
  }
}

//VSYNC output (commands and driver control registers)
void MatrixPanel_DMA::sendVsync()
{
  waitDmaReady();
  bufferReady = false;   //reserve DMA
  bufferBusy = true;     //mask the line output handler
  sendCBVsync();
  bufferBusy = false;

}

//start sending the frame to the drivers back buffer
void MatrixPanel_DMA::sendFrame(bool waitSend, bool autoVsync)
{
  waitDmaReady();
  bufferReady = false;  //reserve DMA
  dma_int_cnt = 0;
  FM6363_auto_vsync = autoVsync;
  dmadesc_suffix[cur_suffix_id^1][desc_suffix_cnt-1].eof = true; //Enable Interrupts
  rows_send_cnt = rows_per_frame; //initialize the line output counter
  //Serial.print(">");Serial.println(back_buffer_id^1);
  if (waitSend) waitDmaReady();
}


//initializing driver control registers with clearing the screen
void MatrixPanel_DMA::FM6363init()
{
  Serial.println("FM6363init(): Start");
  FM6363setVSync(false, true); //disable image output
//  FM6363setVSync(true, true); //enable image output

  for (int i = 0; i < FM6363_REG_CNT; i++)
  {
    sendVsync();
  }
  //one driver buffer
  FM6363_clear= true;
  sendFrame();
  //second driver buffer
  FM6363_clear= true;
  sendFrame();
  FM6363setVSync(true, true); //allow image output
  sendVsync();
  Serial.println("FM6363init(): End");
}

//---------------------------------//
// Buffer initialization functions //
//---------------------------------//

//memory allocation
bool MatrixPanel_DMA::allocateDMAmemory()
{
  /***
  * Step 1: Look at the overall DMA capable memory for the DMA FRAMEBUFFER data only (not the DMA linked list descriptors yet)
  *         and do some pre-checks.
  */
  //size_t row_data_buffer_size;
  size_t matrix_buffer_size = 0;
  size_t subrow_data_len = pixels_per_row + SUBROW_ADD_LEN;  //substring length
  size_t gamma_table_len = 0;
  uint8_t dma_buff_cnt;  //total number of DMA buffers

  m_cfg.double_buff &= 1;
  m_cfg.double_dma_buff &= 1;
  if (m_cfg.driver == FM6363)
  {
    //double video buffer built into the matrix driver, switching via V_SYNC with initialization of one of the registers
    //switching the matrix driver buffer is combined with register transfer
    back_buffer_id = m_cfg.double_buff;
    gamma_table_len = BRIGHT_TABLE_SIZE;

    //prefix buffer
    dma_buff.frame_prefix_len = FRAME_ADD_LEN + FM6363_PREFIX_START_LEN + pixels_per_row;
    dma_buff.frame_prefix_cnt = FM6363_PREFIX_CNT; //V_SYNC + setting up registers
    //suffix buffers
    dma_buff.frame_suffix_len = FM6363_ROW_OE_LEN*rows_per_frame; //*2 - front+recession
    dma_buff.frame_suffix_cnt = FM6363_SUFFIX_CNT;   //iteration of lines
    //line buffers
    dma_buff.row_data_len = subrow_data_len*DRIVER_BITS + ROW_ADD_LEN;
    //size of the primary video buffer and number of data lines
    dma_buff.row_data_cnt = FM6363_DMA_ROW_BUFF_CNT;
    if (dma_buff.row_data_cnt > rows_per_frame) dma_buff.row_data_cnt = rows_per_frame;

    dma_buff.color_bits = -m_cfg.color_depth;
    //requires intermediate video buffer without DMA requirement
    #ifdef SERIAL_DEBUG
		Serial.printf_P(PSTR("Color depth id = %d\r\n"), dma_buff.color_bits);
    #endif

    switch (dma_buff.color_bits)
    {
      #ifdef USE_COLORx16
      case -16:
        //two-byte field
#ifdef SERIAL_DEBUG
        Serial.println(F("MatrixPanel_DMA::allocateDMAmemory(): USE_COLORx16"));
#endif // SERIAL_DEBUG
        frame_buffer.row_len = (pixels_per_row*2 + VB_SIZE - 1)/VB_SIZE;      // 64
        frame_buffer.subframe_len = frame_buffer.row_len*m_cfg.mx_height;     // 4096
        frame_buffer.len = frame_buffer.subframe_len;                         // 64
      break;
      #endif
      default:
        //buffer processing on the user side
#ifdef SERIAL_DEBUG
        Serial.println(F("MatrixPanel_DMA::allocateDMAmemory(): Buffer processing on the user side"));
#endif // SERIAL_DEBUG
        frame_buffer.row_len = 0;
      break;
    }
    //start calculating the size of the shared buffer
    dma_buff_cnt = FM6363_PREFIX_CNT + FM6363_SUFFIX_CNT;
    // Length of prefix (VSYNC) + suffix (Line sitching using GCLK)
    matrix_buffer_size = (dma_buff.frame_prefix_len*FM6363_PREFIX_CNT + dma_buff.frame_suffix_len*FM6363_SUFFIX_CNT)*SIZE_DMA_TYPE;
    // Add length of frame buffer
    matrix_buffer_size += (frame_buffer.len*VB_SIZE) << m_cfg.double_buff;
  } else {
    Serial.println("Support SHIFT drivers - disabled!");
    buffersFree();
    return false;
  }
  dma_buff.all_row_data_cnt = dma_buff.row_data_cnt << m_cfg.double_dma_buff;
  dma_buff_cnt += dma_buff.all_row_data_cnt;
  // Add space for ...
  matrix_buffer_size += dma_buff.row_data_len*dma_buff.all_row_data_cnt*SIZE_DMA_TYPE + gamma_table_len*sizeof(uint16_t);

  size_t heap_free_size = heap_caps_get_free_size(MALLOC_CAP_DMA);
	// 1. Calculate the amount of DMA capable memory that's actually available
  #ifdef SERIAL_DEBUG
  if (m_cfg.double_dma_buff)
  {
    Serial.println(F("DOUBLE FRAME BUFFERS / DOUBLE BUFFERING IS ENABLED. DOUBLE THE RAM REQUIRED!"));
  }
  Serial.println(F("DMA memory blocks available before any malloc's: "));
  heap_caps_print_heap_info(MALLOC_CAP_DMA);
	Serial.println(F("******************************************************************"));
  Serial.printf_P(PSTR("We're going to need %d bytes of SRAM just for the frame buffer(s).\r\n"), matrix_buffer_size);
  Serial.printf_P(PSTR("The total amount of DMA capable SRAM memory is %d bytes.\r\n"), heap_free_size);
  Serial.printf_P(PSTR("Largest DMA capable SRAM memory block is %d bytes.\r\n"), heap_caps_get_largest_free_block(MALLOC_CAP_DMA));
  if (m_cfg.driver == FM6363)
	Serial.println(F("******************************************************************"));
  #endif

  // Can we potentially fit the framebuffer into the DMA capable memory that's available?
  if ( heap_free_size < matrix_buffer_size  )
  {
    #ifdef SERIAL_DEBUG
    Serial.printf_P(PSTR
      ("######### Insufficient memory for requested resolution. Reduce MATRIX_COLOR_DEPTH and try again.\r\n\tAdditional %d bytes of memory required.\r\n\r\n"),
      (matrix_buffer_size-heap_caps_get_free_size(MALLOC_CAP_DMA)) );
    #endif
    return false;
  }
  // Allocate memory for the two rowBits pointers
  dma_buff.rowBits = (ESP32_I2S_DMA_STORAGE_TYPE**)heap_caps_calloc(dma_buff_cnt,sizeof(void*), MALLOC_CAP_32BIT | MALLOC_CAP_DMA);
  if (dma_buff.rowBits == NULL)
  {
    #ifdef SERIAL_DEBUG
		Serial.printf_P(PSTR("ERROR: Couldn't malloc frameBits ptrs %d! Critical fail.\r\n"), (uint32_t)dma_buff.rowBits);
    #endif
    return false;
  }

  size_t data_len = dma_buff.row_data_len;
  //allocate DMA buffer to lines
	for (int malloc_num = 0; malloc_num < dma_buff_cnt; malloc_num++)
	{
    #ifdef SERIAL_DEBUG
		Serial.print("Malloc memory for ");
    #endif
    //here is optimization for the fact that there are no more than two service buffers
    if (malloc_num >= dma_buff.all_row_data_cnt)
    {
      if (malloc_num < (dma_buff.all_row_data_cnt + dma_buff.frame_prefix_cnt))
      {
        data_len = dma_buff.frame_prefix_len;
        #ifdef SERIAL_DEBUG
		    Serial.print("Prefix");
        #endif
      }
      else
      {
        data_len = dma_buff.frame_suffix_len;
        #ifdef SERIAL_DEBUG
		    Serial.print("Suffix");
        #endif
      }
    }else
    {
      #ifdef SERIAL_DEBUG
		  Serial.print("Row");
      #endif
    }
    dma_buff.rowBits[malloc_num] = (ESP32_I2S_DMA_STORAGE_TYPE*)heap_caps_calloc(data_len, SIZE_DMA_TYPE,  MALLOC_CAP_DMA);

    if (dma_buff.rowBits[malloc_num] == NULL)
    {
      #ifdef SERIAL_DEBUG
		  Serial.printf_P(PSTR(" - ERROR: Couldn't malloc DMA buffer %d! Critical fail.\r\n"), malloc_num);
      #endif
      buffersFree();
    	return false;
    }
    #ifdef SERIAL_DEBUG
    Serial.printf_P(PSTR(": %d bytes @ address %u(d) (DMA buffer %d).\r\n"), data_len*SIZE_DMA_TYPE, (uint32_t)dma_buff.rowBits[malloc_num], malloc_num);
    #endif
	}
  //allocate a non-DMA primary buffer for FM6363
  if (frame_buffer.len > 0)
  {
    for (int frame_id = m_cfg.double_buff; frame_id >= 0; frame_id--)
    {
      #ifdef SERIAL_DEBUG
		  Serial.printf_P(PSTR("Malloc memory for primary framebuffer %d"), frame_id);
      #endif

