ocram72nl/ESP32-HUB75-MatrixPanel-DMA-FM6363/src/ESP32-HUB75-MatrixPanel-DMA-fm6363c.cpp
      frame_buffer.frameBits[frame_id] = (vbuffer_t*)heap_caps_calloc(1, frame_buffer.len*VB_SIZE, MALLOC_CAP_8BIT);
      if (frame_buffer.frameBits[frame_id] == NULL)
      {
      #ifdef SERIAL_DEBUG
		    Serial.printf_P(PSTR(" - ERROR: Couldn't malloc frame_buffer! Critical fail.\r\n"));
        #endif
        buffersFree();
    	  return false;
      }
      #ifdef SERIAL_DEBUG
      Serial.printf_P(PSTR(": %d bytes @ address %u(d) (no DMA buffer).\r\n"), frame_buffer.len*VB_SIZE, (uint32_t)frame_buffer.frameBits[frame_id]);
      #endif
    }
  }
  if (gamma_table_len > 0)
  {
    #ifdef SERIAL_DEBUG
		Serial.println(PSTR("Malloc memory for gamma-color - 512b"));
    #endif
    brightness_table = (uint16_t*)heap_caps_calloc(1, gamma_table_len*sizeof(uint16_t), MALLOC_CAP_8BIT);
    if (brightness_table == NULL)
    {
      #ifdef SERIAL_DEBUG
		  Serial.printf_P(PSTR(" - ERROR: Couldn't malloc gamma-color buffer! Critical fail.\r\n"));
      #endif
      buffersFree();
    	return false;
    }
  }

  //number of DMA descriptors
  desc_data_cnt = (dma_buff.row_data_len*SIZE_DMA_TYPE + DMA_MAX-1)/DMA_MAX; //descriptors per line
  desc_data_cnt *= dma_buff.row_data_cnt; //descriptors for output lines (one buffer)
  desc_prefix_cnt = (dma_buff.frame_prefix_len*SIZE_DMA_TYPE + DMA_MAX-1)/DMA_MAX;
  desc_prefix_cnt *= dma_buff.frame_prefix_cnt;
  desc_suffix_cnt = (dma_buff.frame_suffix_len*SIZE_DMA_TYPE + DMA_MAX-1)/DMA_MAX;
  desc_suffix_cnt *= dma_buff.frame_suffix_cnt;

 //reservation of DMA descriptors
  int desc_cnt = desc_suffix_cnt;
  int desc_ext_cnt = 0;

  if (m_cfg.driver == FM6363)
  {
    desc_ext_cnt = FM6363_DESCEXT_CNT; //entry points with continuation of line addresses
    desc_cnt *= FM6363_DSUFFIX_CNT;
  }
  #ifdef SERIAL_DEBUG
  Serial.printf_P(PSTR("Descriptors rows count: %d\r\n"), desc_data_cnt << m_cfg.double_dma_buff);
  Serial.printf_P(PSTR("Descriptors prefix count: %d\r\n"), desc_prefix_cnt);
  Serial.printf_P(PSTR("Descriptors suffix count: %d\r\n"), desc_cnt);
  Serial.printf_P(PSTR("Descriptors ext count: %d\r\n"), desc_ext_cnt);
  #endif
  desc_cnt += (desc_data_cnt<< m_cfg.double_dma_buff) + desc_prefix_cnt + desc_ext_cnt;   //total descriptors

  #ifdef SERIAL_DEBUG
  Serial.printf_P(PSTR("All DMA desk count = %d\r\n"),desc_cnt);
  #endif

  //allocate a shared buffer to descriptors
  dmadesc_data[0] = (lldesc_t *)heap_caps_calloc(desc_cnt, sizeof(lldesc_t), MALLOC_CAP_DMA);
  if(dmadesc_data[0] == NULL)
  {
    #ifdef SERIAL_DEBUG
    Serial.println(("ERROR: Could not malloc descriptors"));
    #endif
    buffersFree();
    return false;
  }
  size_t _dma_capable_memory_reserved = desc_cnt*sizeof(lldesc_t);
  #ifdef SERIAL_DEBUG
  Serial.printf_P(PSTR("Descriptors memory reserved: %d\r\n"), _dma_capable_memory_reserved);
  #endif

  //distribute descriptors
  //lines
  if (m_cfg.double_dma_buff) dmadesc_data[1] = &dmadesc_data[0][desc_data_cnt]; else dmadesc_data[1] = dmadesc_data[0];
  //prefix
	if (dma_buff.frame_prefix_cnt > 0)dmadesc_prefix = &dmadesc_data[1][desc_data_cnt]; else dmadesc_prefix = &dmadesc_data[0][0];
  //suffixes
  dmadesc_suffix[0] = &dmadesc_prefix[desc_prefix_cnt];
  if (m_cfg.driver == FM6363)
  {
    dmadesc_suffix[1] = &dmadesc_suffix[0][desc_suffix_cnt];
    dmadesc_ext = &dmadesc_suffix[1][desc_suffix_cnt];
  }

  #ifdef SERIAL_DEBUG
  Serial.printf_P(PSTR("Descriptors data[0] address: %u(d), count: %d\r\n"), (uint32_t)dmadesc_data[0], desc_data_cnt);
  Serial.printf_P(PSTR("Descriptors data[1] address: %u(d), count: %d\r\n"), (uint32_t)dmadesc_data[1], desc_data_cnt);
  Serial.printf_P(PSTR("Descriptors prefix address: %u(d), count: %d\r\n"), (uint32_t)dmadesc_prefix, desc_prefix_cnt);
  Serial.printf_P(PSTR("Descriptors suffix[0] address: %u(d), count: %d\r\n"), (uint32_t)dmadesc_suffix[0], desc_suffix_cnt);
  Serial.printf_P(PSTR("Descriptors suffix[1] address: %u(d), count: %d\r\n"), (uint32_t)dmadesc_suffix[1], desc_suffix_cnt);
  Serial.printf_P(PSTR("Descriptors ext address: %u(d), count: %d\r\n"), (uint32_t)dmadesc_ext, desc_ext_cnt);
  #endif


  #ifdef SERIAL_DEBUG
  _dma_capable_memory_reserved += matrix_buffer_size;
  Serial.println(F("*** ESP32-HUB75-MatrixPanel-I2S-DMA: Memory Allocations Complete ***"));
  Serial.printf_P(PSTR("Total DMA memory that was reserved: %dkB,%dB .\r\n"), _dma_capable_memory_reserved/1024, _dma_capable_memory_reserved%1024);
  Serial.printf_P(PSTR("Total NODMA memory that was reserved: %dkB,%dB.\r\n"), ((frame_buffer.len+gamma_table_len)*VB_SIZE)/1024, ((frame_buffer.len+gamma_table_len)*VB_SIZE)%1024);
  //Serial.printf_P(PSTR("... of which was used for the DMA Linked List(s): %d kB.\r\n"), _dma_linked_list_memory_required/1024);
  Serial.printf_P(PSTR("General RAM Available: %d bytes total. Largest free block: %d bytes.\r\n"),
    heap_caps_get_free_size(MALLOC_CAP_DEFAULT), heap_caps_get_largest_free_block(MALLOC_CAP_DEFAULT));
  #endif

  return true;

} // end allocateDMAmemory()

//DMA linking of buffer descriptors
lldesc_t* linkDmaDesc(lldesc_t* dmadesc, lldesc_t* previous_dmadesc, int dmadesk_cnt, uint8_t* dma_buffer, int bufer_size, int max_dma_size)
{
  size_t dma_size;
  while((dmadesk_cnt > 0)&&(bufer_size > 0))
  {
    dma_size = (bufer_size >= max_dma_size)?max_dma_size:bufer_size;
    link_dma_desc(dmadesc, previous_dmadesc, dma_buffer, dma_size);
    previous_dmadesc = dmadesc;
    dmadesc = &dmadesc[1];
    dma_buffer += dma_size;
    bufer_size -= dma_size;
    dmadesk_cnt--;
  }
  return previous_dmadesc;
}

//DMA linking of buffer descriptors
lldesc_t* linkDmaDesc_n(lldesc_t* dmadesc, lldesc_t* previous_dmadesc, int single_dmadesk_cnt, uint8_t** dma_buffer, int single_bufer_size, int max_dma_size, int buffers_cnt)
{
  int i = 0;
  while (i < buffers_cnt)
  {
    previous_dmadesc = linkDmaDesc(dmadesc, previous_dmadesc, single_dmadesk_cnt, dma_buffer[i], single_bufer_size,max_dma_size);
    dmadesc = &previous_dmadesc[1];
    i++;
  }
  return previous_dmadesc;
}

// DMA Settings
void MatrixPanel_DMA::configureDMA()
{
  #ifdef SERIAL_DEBUG
  Serial.println(F("configureDMA(): Starting configuration of DMA engine.\r\n"));
  #endif

  #ifdef SERIAL_DEBUG
  Serial.println("configureDMA(): Link dmadesc_prefix.");
  #endif
  linkDmaDesc_n(dmadesc_prefix, NULL, desc_prefix_cnt, (uint8_t**)&dma_buff.rowBits[offset_prefix], dma_buff.frame_prefix_len*SIZE_DMA_TYPE,DMA_MAX, dma_buff.frame_prefix_cnt);

  #ifdef SERIAL_DEBUG
  Serial.println("configureDMA(): Link dmadesc_suffix.");
  #endif
  linkDmaDesc_n(dmadesc_suffix[0], NULL, desc_suffix_cnt, (uint8_t**)&dma_buff.rowBits[offset_suffix], dma_buff.frame_suffix_len*SIZE_DMA_TYPE,DMA_MAX, dma_buff.frame_suffix_cnt);

  #ifdef SERIAL_DEBUG
  Serial.println("configureDMA(): Link dmadesc_data.");
  #endif
  linkDmaDesc_n(dmadesc_data[0], NULL, desc_data_cnt, (uint8_t**)dma_buff.rowBits, dma_buff.row_data_len*SIZE_DMA_TYPE,DMA_MAX, dma_buff.all_row_data_cnt);

  if (m_cfg.driver == FM6363)
  {
    #ifdef SERIAL_DEBUG
    Serial.println("configureDMA(): Link dmadesc_suffix 2.");
    #endif
    linkDmaDesc_n(dmadesc_suffix[1], NULL, desc_suffix_cnt,
      (uint8_t**)&dma_buff.rowBits[offset_suffix], dma_buff.frame_suffix_len*SIZE_DMA_TYPE,DMA_MAX, 1);
    for(int i = FM6363_DESCEXT_CNT-1; i >= 0; i--)
    {
      //only for initializing all descriptor fields
      link_dma_desc(&dmadesc_ext[i], NULL, NULL, 0);
    }
    //preparing configuration registers

    // Allocate memory
    driver_reg = (driver_rgb_t*)heap_caps_calloc(FM6363_REG_CNT, sizeof(driver_rgb_t), MALLOC_CAP_8BIT);
    if (driver_reg == NULL)
    {
      buffersFree();
      return;
    }
    // Copy the register values to the driver_reg allocated memory
    memcpy(driver_reg, FM6363_REG_VALUE, FM6363_REG_CNT*sizeof(driver_rgb_t));
    // Adjust the Line Count setting according to configured settings
    setDriverRegRGB(&driver_reg[FM6363_CFG1], (rows_per_frame-1), FM6363_CFG1_LC_MASK, FM6363_CFG1_LC_OFFSET);
    FM6363initBuffers();
    bufferReady = false;
    bufferBusy = false;
    FM6363_clear = false;
    FM6363_auto_vsync = false;
    getUserRGB = NULL;
    drawUserPixel = NULL;
    driver_cur_reg = 0;
    cur_suffix_id = 0;
    rows_send_cnt = 0;
    dma_int_cnt = 0;
  }else
  {
    //shift
  }
  #ifdef SERIAL_DEBUG
  Serial.println(F("configureDMA(): Inited buffers.\r\n"));
  #endif

  //End markers for DMA LL

  #ifdef SERIAL_DEBUG
  Serial.println(F("Performing I2S setup:"));
  #endif

  i2s_parallel_config_t cfg =
  {
    .gpio_bus = {
      m_cfg.gpio.r1, m_cfg.gpio.g1, m_cfg.gpio.b1,
      m_cfg.gpio.r2, m_cfg.gpio.g2, m_cfg.gpio.b2,
      m_cfg.gpio.lat, m_cfg.gpio.oe,
      m_cfg.gpio.a, m_cfg.gpio.b, m_cfg.gpio.c, m_cfg.gpio.d, m_cfg.gpio.e,
      -1, -1, -1},
    .gpio_clk = m_cfg.gpio.clk,
    .sample_rate = m_cfg.clk_freq,
    .sample_width = ESP32_I2S_DMA_MODE,
    .desccount_a = desc_data_cnt, //use only for SHIFT drivers
    .lldesc_a = dmadesc_data[0],  //
    .desccount_b = desc_data_cnt, //use only for SHIFT drivers
    .lldesc_b = dmadesc_data[1],  //use only for SHIFT drivers
    .clkphase = m_cfg.clk_phase
  };

